Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
ACAPI::v1::Object Class Reference
API Infrastructure
A base class for all ACAPI objects. Purely technical. More...
#include <Object.hpp>
 Inheritance diagram for ACAPI::v1::Object:
 Public Member Functions
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
~Object ()
Default destructor.
 Protected Attributes
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
 Friends
 class  | Impl::UsageLogger
 template<class T >
class  | Impl::ImplAccessor
Detailed Description
A base class for all ACAPI objects. Purely technical.
Constructor & Destructor Documentation
◆ Object()
 ACAPI::v1::Object::Object  |  ( |  std::shared_ptr< Impl::ObjectImpl >  |  impl | )
Constructs a new object.
Parameters
impl | Impl instance of the object.
Member Function Documentation
◆ GetToken()
 const API_Token & ACAPI::v1::Object::GetToken  |  ( |   | ) |   const
Get the token for this object.
Returns
The token for this object.